<?php

/* Ukrainian translation for KVIrc.net Website. Made by Igor Paliychuk <mansonigor[at]gmail[dot]com> */
/* index.php start */
// languages
$template['index']['brazilian']="Бразильська";
$template['index']['bulgarian']="Болгарська";
$template['index']['catalan']="Каталонська";
$template['index']['croatian']="Хорватська";
$template['index']['czech']="Чеська";
$template['index']['dutch']="Голландська";
$template['index']['english']="Англійська";
$template['index']['finnish']="Фінська";
$template['index']['french']="Французька";
$template['index']['german']="Німецька";
$template['index']['hungarian']="Угорська";
$template['index']['italian']="Італійська";
$template['index']['latvian']="Латвійська";
$template['index']['polish']="Польська";
$template['index']['portuguese']="Португальська";
$template['index']['russian']="Російська";
$template['index']['serbian']="Сербська";
$template['index']['spanish']="Іспанська";
$template['index']['ukrainian']="Українська";

// the project
$template['index']['theproject']="проект";
$template['index']['status']="статус";
$template['index']['features']="можливості";
$template['index']['license']="ліцензія";
$template['index']['screens']="скріншоти";
$template['index']['bugtrack']="база помилок KVIrc";
// running kvirc
$template['index']['running']="запуск KVIrc";
$template['index']['download']="завантаження";
$template['index']['releases']="офіційні релізи";
$template['index']['snapshots']="знімки";
$template['index']['git']="git";
$template['index']['install']="встановлення";
// documentation
$template['index']['docs']="документація";
$template['index']['faq']="ЧаПи";
$template['index']['api']="API";
$template['index']['doc']="посібник KVIrc";
$template['index']['tutorials']="підручники";
$template['index']['translations']="переклади";
$template['index']['shortcuts']="гарячі клавіші";
$template['index']['faq2']="ЧаПи (Вікі)";

// graphic suite
$template['index']['graphsuite']="графічний пакет";
$template['index']['themes']="теми";
$template['index']['splash']="заставки";
$template['index']['banners']="банери";
$template['index']['arts']="графіка";
// misc
$template['index']['misc']="різне";
$template['index']['honor']="честь &amp; слава";
$template['index']['scripts']="скрипти";
$template['index']['addons']="доповнення";
$template['index']['tools']="інструменти";
$template['index']['changelog']="перелік змін";
// contact
$template['index']['contact']="контакт";
$template['index']['ml']="список розсилки KVIrc";
$template['index']['archive']="архів";
$template['index']['contribute']="співпраця";
$template['index']['help']="довідка";
$template['index']['donation']="зробити пожертву";
// KVIrc related
$template['index']['related']="пов'язане";
$template['index']['forum']="офіційний форум";
$template['index']['rusite']="російський сайт";
//$template['index']['frsite']="французький сайт";
//$template['index']['frforum']="французький форум";
$template['index']['osxsite']="збірки для OS X";
// other
$template['index']['quickdnl']="швидке завантаження";
// search
$template['index']['search']="Пошук";
$template['index']['go']="GO";
// news
$template['index']['latestnews']="останні новини";
$template['index']['allnews']="Всі новини";
// mirrors
$template['index']['mirrors']="дзеркала";
$template['index']['wwwmirrors']="WWW-дзеркала";
$template['index']['ftpmirrors']="FTP-дзеркала";
$template['index']['mirrorstext1a']="Допомога проекту KVIrc віддзеркалюванням його файлів є простим та цінним; на";
$template['index']['mirrorstext1b']="цій сторінці";
$template['index']['mirrorstext1c']="ви знайдете інструкції щодо створення WWW чи FTP дзеркала (чи обох).";
$template['index']['mirrorstext2']="Також нам дуже потрібні не-Європейські ftp.";
$template['index']['mirrorstitle']="www та ftp-віддзеркалювання";
// layouts
$template['index']['oldlayout']="схеми старого сайту";
$template['index']['oldsite']="старий сайт KVIrc";
$template['index']['iakkohome']="домашня сторінка iakko";
// help
$template['index']['helptext1a']="Якщо вам потрібна допомога тоді зв'яжіться з нами через";
$template['index']['helptext1b']="публічний список розсилки KVIrc";
$template['index']['helptext1c']="або при'єднайтесь до виділених каналів";
// bugs
$template['index']['bugreport']="звіт про баг";
$template['index']['bugstext']="помилки можуть бути звітовані та переглянуті з використанням системи відстежування помилок KVIrc, що достуна на";
// more docs
$template['index']['moredocs']="ще документи";
$template['index']['officialdocs']="офіційна документація KVIrc";
$template['index']['docsauto']="автоматично згенерований індексний запит";
// hardware, traffic and hosting donation
$template['index']['hwdonation']="реактивний";
$template['index']['hwdonationtext']="пожертвував залізо для роботи *.kvirc.de";
$template['index']['tahdonation']="підняв в повітря";
$template['index']['tahdonationtext']="спонсорує хостинг та трафік для *.kvirc.de";
$template['index']['donationtextkvirc.de']="і це дзеркало";
// other
$template['index']['latestscreen']="свіжий скріншот";
$template['index']['footer']="цей сайт найкраще переглядати з монітором";
/* index.php end */

/* custom vars start */
$template['custom']['author']="Автор";
$template['custom']['description']="Опис";
$template['custom']['homepage']="Домашня сторінка";
$template['custom']['download']="Завантажити";
$template['custom']['downbig']="Великий";
$template['custom']['date']="Дата";
$template['custom']['size']="Розмір";
$template['custom']['version']="Версія";
$template['custom']['type']="Тип";
$template['custom']['city']="Місто";
$template['custom']['maintainer']="Супроводжуючий";
$template['custom']['optional']="Опціонально";
$template['custom']['showhide']="Показати / сховати все";
/* custom vars end */

/* addons.php start */
$template['addons']['title']="Доповнення";
$template['addons']['text1']="Тут ви можете знайти набір скриптових доповнень для KVIrc";
$template['addons']['text1b']="
	Всі вони вимагають принаймні версію 4.0.0.<br />
	Будь ласка, <b>виберіть вашу версію</b> KVIrc:";
$template['addons']['text2']="Щоб встановити доповнення";
$template['addons']['tree1']="<b>Завантажте</b> доповнення";
$template['addons']['tree2']="
	Натисніть <b>CTRL+Shift+N</b> щоб відкрити діалог Керування Доаовненнями (або відкрийте його з меню Налаштувань)";
$template['addons']['tree3']="Натисніть кнопку \"<b>Встановити пакунок доповнення з диску</b>\" ";
$template['addons']['tree4']="
	Перейдіть до місця де знаходиться пакунок доповнення і виберіть його";
$template['addons']['sorry']="Вибачте, не знайдено доповнень для вказаної версії KVIrc";
$template['addons']['addon1']="Автоматично переходить в стан відстуності після періоду неактивності";
$template['addons']['addon2']="Додає кнопки на панелі для декотрих найбільш використовуваних операцій з каналами";
$template['addons']['addon3']="Показує статистику для приєднаного каналу";
$template['addons']['addon4']="Простий скрипт що визначає де знаходиться хост";
$template['addons']['addon5']="Автоматично вводить дані шифрування для ваших кодованих об'єктів";
$template['addons']['addon6']="Додає ярлики і кнопки на панелі інструментів для команд EZBounce IRC проксі";
$template['addons']['addon7']="Проста one-o-one гра";
$template['addons']['addon8']="Простий F-Server";
$template['addons']['addon9']="Простий скрипт для lol-and-kiss клавішами F3-F8 і для кумедного письма";
$template['addons']['addon10']="Простий скрипт для оголошення відтворюваного mp3 та опція обміну";
$template['addons']['addon11']="Чудовий \"часоїд\"";
$template['addons']['addon12']="Показує RSS-новини з кількох джерел";
$template['addons']['addon13']="
	Дозволяє рекламувати та обмінюватись відтворюваним медіа в IRC-каналах та особисто";
$template['addons']['addon14']="Простий скрипт для керування публічними уроками";
$template['addons']['addon15']="Реалізовує простий Quiz-бот";
$template['addons']['addon16']="Дозволяє надсилати SMS повідомлення через кілька веб сервісів";
$template['addons']['addon17']="Дозволяє користувача попереджувати, копати та банити тих, хто сказав заборонені слова";
$template['addons']['addon18']="Автоматична система op/voice/ban для ваших каналів (аддон з скрипта Twins)";
$template['addons']['addon19']="
	Змінює колір введеного вами тексту на каналі, особисто та в DCC чатах (аддон з скрипта Twins)";
$template['addons']['addon20']="Проста панель відставання з трьома різними кольорами (аддон з скрипта Twins)";
$template['addons']['addon21']="
	Керуй своїм медіа програвачем віддалено і пропонуй музику іншим користувачам (аддон з скрипта Twins)";
$template['addons']['addon22']="Перевіряє попередній хост користувача";
$template['addons']['addon23']="Простий змінювач набору значків. Можна вибрати старі, нові зі старими смайлами або нові значки";
/* addons.php end */

/* archive.php start */
$template['archive']['title']="Архів списків розсилки";
$template['archive']['text']="
	Тут ви можете знайти архів списків розсилки: якщо у вас проблеми, загляньте сюди в першу чергу.<br />
	Ви можете оглянути архів вручну або скористатись формою для пошуку.";
$template['archive']['search']="Пошук Google";
$template['archive']['jan']="Січень";
$template['archive']['feb']="Лютий";
$template['archive']['mar']="Березень";
$template['archive']['apr']="Квітень";
$template['archive']['may']="Травень";
$template['archive']['jun']="Червень";
$template['archive']['jul']="Липень";
$template['archive']['aug']="Серпень";
$template['archive']['sep']="Вересень";
$template['archive']['oct']="Жовтень";
$template['archive']['nov']="Листопад";
$template['archive']['dec']="Грудень";
/* archive.php end */

/* arts.php start */
$template['arts']['title']="Графіка";
$template['arts']['text']="Колекція різноманітної графіки, пов'язаної з KVIrc.";
$template['arts']['desc1']="
	Шість кольорових варіантів чудової коміксоподібної теми для заміни заставок. Просто збережіть вибране зображення як \$HOME/.kvirc/pics/kvi_splash.png. Ці заставки також можна використати як банери чи точку відліку для власних зображень.
	";
$template['arts']['desc2']="Ще одна версія \"Marmalade\" від suspiria :)";
$template['arts']['desc3']="Га ?";
$template['arts']['desc4']="Початкова точка для аватару.";
$template['arts']['desc6']="Вона використовує це як заставку... :)";
/* arts.php end */

/* banners.php start */
$template['banners']['title']="Банери";
$template['banners']['text1']="
	Це колекція банерів KVIrc зроблена різними авторами: ви зберігаєтье зображення і використовуєте його на вашому сайті :)";
$template['banners']['text2']="Відправте ваші банери до";
$template['banners']['bannerby']="Банери від";
/* banners.php end */

/* contribute.php start */
$template['contribute']['title']="Як допомогти";
$template['contribute']['text1']="
	Проекту KVIrc можна допомогти багатьма шляхами. Можна багато чого робити і це буде вимагати різних розробницьких вмінь (від \"майже ніяких\" до \"гуру\").";
$template['contribute']['text2']="Написання коду";
$template['contribute']['text3']="
	Основним завданням є звісно написання коду. Розробка ядра KVIrc та зовнішніх модулів вимагає доброго знання C++.<br />
	Графічний інтерфейс KVIrc використовує бібліотеку Qt (і зрештою KDE) тому знання цих бібліотек може знадобитись. В дереві коду є багато областей: мережа, криптографія, стиснення даних, розбір мов...<br />
	Кожен рівень внеску є цінним: від дворядкових патчів до впровадження та супроводження можливостей ядра.";
$template['contribute']['text4']="Створення графіки";
$template['contribute']['text5']="
	\"V\" в KVIrc означає \"Visual\". Графіка допомагає користувачам переходити по інтерфейсу та швидко впізнавати різноманітні можливості програми. Нам потрібні значки, забраження діалогів, заставки, логотипи, маскот... Гарною ідеєю є розробити цілісну графічну тему...";
$template['contribute']['text6']="Написання документації";
$template['contribute']['text7']="
	Документація є такою ж важливою як і програма.<br />
	Багато можливостей KVIrc є прихованими для звичайного користувача просто тому, що вони не згадуються в публічних документах.<br />
	Допомога з документацією означає наступне: збирання ЧаПів і вставка їх в читабельну форму з можливістю пошуку, написання документів про специфічні можливості, написання посібників.<br />
	Нам потрібне добре написане \"введення в KVIrc для початківців\" (це також може бути введенням в IRC загалом).";
$template['contribute']['text8']="Переклад повідомлень KVIrc";
$template['contribute']['text9']="
	Інтерфейс KVIrc базований на тексті: рядки інтерфейсу потребують перекладу на всі можливі мови. Вам лише треба знати не Англійську мову: схема перекладу основана на gettext і вимагає мінімального знання написання коду.";
$template['contribute']['text10']="Переклад документації";
$template['contribute']['text11']="
	Базова частина документації повинна бути перекладена на інші мови щоб кожен міг повністю зрозуміти \"основні\" можливості KVIrc.<br />
	Це вимагає ще меншого знання написання коду ніж переклад програми.";
$template['contribute']['text12']="Керування/розробка сайту";
$template['contribute']['text13']="
	Вебсайт потребує розширення та супроводу.<br />
	Для цього потрібне знання php, xhtml, css і трохи ідей :)";
$template['contribute']['text14']="Віддзеркалювання";
$template['contribute']['text15']="
	FTP та WWW дзеркала завжди вітаються: нам невистачає дзеркал за межами Європи.<br />
	WWW-cайт написаний на php і оновлюється з Git, тому машина для віддзеркалювання повинна мати php-сумісний веб сервер та встановлений Git клієнт.<br />
	FTP-архів займає близько 1.2GB; можна також організувати часткове віддзеркалювання.<br />
	Детальні інструкції щодо налаштування WWW чи FTP дзеркал доступні <a href=\"?id=mirroring&amp;lang=$lang\">тут</a>.";
$template['contribute']['text16']="Публічні відносини";
$template['contribute']['text17']="
	Нам потрібні люди, що говорять про KVIrc, пишуть статті, описи, огляди, шукають однодумців...";
$template['contribute']['text18']="З ким зв'язатись";
$template['contribute']['text19']="
	Якщо ви зацікавлені в тому, щоб допомогти проекту, пишіть ваші пропозиції до <a href=\"mailto:pragma [at] kvirc [dot] net\">Pragma</a>.<br />
	Іншим місцем, де можна включитись в роботу та висловити свої ідеї є IRC-канал <a href=\"irc://chat.ircnet.org/#kvirc\">#KVIrc</a> в мережі IRCNet, <a href=\"irc://irc.azzurra.org/#KVIrc.net\">#KVIrc.net</a> в Azzurra чи <a href=\"irc://irc.freenode.org/#kvirc\">#KVIrc</a> в мережі FreeNode (раніше відома як мережа OpenProjects).";
/* contribute.php end */

/* donate.php start */
$template['donate']['title']="Підтримка проекту KVIrc грошовими внесками";
$template['donate']['text1']="
	KVIrc є безкоштовним і завжди таким буде: вам не потрібно платити гроші за його завантаження, використання, зміну і обмін початковим кодом.";
$template['donate']['text2']="
	Більшість фізичних ресурсів, завдяки яким живе KVIrc (такі як WWW чи FTP сервери) забезпечуються безплатно учасниками команди KVIrc. З іншого боку проект вимагає величезну кількість часу для написання коду а також декілька речей, що потребують оплати як наприклад оновлення заліза, реєстрація доменного імені, хостинг, книги... Якщо вам подобається KVIrc, будь ласка підтримайте проект матеріально: ви можете зробити внесок через PayPal.";
$template['donate']['text3']="
	Кнопка нище перенесе вас на сайт PayPal де ви зможете вказати суму та валюту. Ви можете пожертвувати скільки хочете: ми будемо все одно вдячні. Якщо ви не вористувались PayPal раніше, тоді сайт спитає вас про детальні дані вашої кредитки, вашу країну, адресу і домашній телефон. Ці дані необхідні для PayPal щоб здійснити переведення грошей і не потрібні та не видимі команді KVIrc.";
$template['donate']['text4']="
	Після внесення пожертви на ваш e-mail прийде лист з питанням чи ви хочете щоб ваш внесок відображався на цій сторінці. Після використання грошей рядом з тим, хто їх вніс і сумою, буде вказана мета використання грошей.";
$template['donate']['text5']="Дякуємо! :)";
$template['donate']['title2']="Недавні пожертви";
$template['donate']['donation']="пожертвувано";
$template['donate']['alttext']="Пожертвуйте кошти проекту KVIrc користуючись PayPal";
/* donate.php end */

/* download.php start */
$template['download']['title']="Завантаження KVIrc";
$template['download']['text1']="Ви можете отримати KVIrc трьома шляхами:";
$template['download']['text2']="Пакунки офіційних релізів";
$template['download']['text3']="
	Офіційні пакунки випускаються рідше але є найбільш стабільними. Кожен офіційний пакунок початкових кодів добре тестується і швидше за все збереться на вашій системі. Також ви матимете більше шансів знайти бінарні пакунки для вашої системи. Онлайн ЧаПи та документація посилаються на цей тип пакунків.";
$template['download']['text4']="Розробницькі знімки";
$template['download']['text5']="
	Розробницькі знімки є неофіційними пакунками зробленими з Git на нерегулярній основі. Кожен знімок відображає стан Git певної ревізії і ви швидше всього знайдете останній. Пакунки були протестовані хоча б на кількох системах і ймовірно зберуться і у вас. Також наявні деякі бінарні збірки.";
$template['download']['text6']="Останні початкові коди з Git";
$template['download']['text7']="
	Найсвіжіші початкові коди можуть бути завантажені через систему Git. Ми стараємось утримувати Git в \"чистоті\" але все ж таки код може не скомпілюватись. Метод Git надає лише початковий код: бінарні збірки відсутні.";
/* download.php end */

/* faq.php start */
$template['faq']['title']="ЧаПи";
$template['faq']['text1a']="Як приєднатись до каналу";
$template['faq']['text1b']="Введіть \"/join #назва_каналу\"";
$template['faq']['text2a']="Я не можу зібрати KVIrc (будь-яка версія)";
$template['faq']['text2b']="
	ЧИТАЙТЕ інструкції в файлі INSTALL: основні проблеми можуть бути вирішені налаштуванням змінних оточення та зміною опцій ./configure. Якщо файл INSTALL не допомагає зайдіть на канал #kvirc на IRCNet або FreeNode: там є багато досвідчених користувачів, які можуть спробувати допомогти. Якщо ви все ще в халепі, опишіть вашу проблему в списку розсилки KVIrc";
$template['faq']['text3a']="Я не можу приєднатись до IPv6-сервера";
$template['faq']['text3b1']="
	Спершу переконайтесь що ваш IPv6-стек встановлено правильно.<br />
	Ви можете здійснити ping6 на інші IPv6-машини";
$template['faq']['text3b2']="
	Чи встановлена підтримка IPv6 в виконуваному файлі KVIrc.<br />
	Щоб перевірити спробуйте";
$template['faq']['text3b3']="
	в командному рядку KVIrc. Ви повинні отримати перелік функцій, зібраних в файлі. Якщо перелік містить \"IPv6\" тоді підтримка включена, інакше перевірте стадію компіляції щоб дізнатись причину.
	Щоб приєднатись до IPv6-сервера використайте /server -i &lt;назва_сервера&gt;
	Ящо ви можете пропінгувати інші IPv6-машини, тоді підтримка IPv6 включена в виконуваний файл. Якщо ви все ще не можете приєднатись до *існуючого* IPv6-сервера тоді можливо ви знайшли баг :) Відзвітуйте його";
$template['faq']['text4a']="Як атоматично входити на канали";
$template['faq']['text4b1']="
	Існує багато шляхів.
	Наприклад";
$template['faq']['text4b2']="
	Виберіть \"Скриптинг/Події\" в меню KVIrc<br />
	Знайтіь пункт \"OnIrc\" на лівій панелі вікна що відкриється.<br />
	Клацніть правою на цьому елементі і виберіть \"Додати обробник\".<br />
	Буде створений \"стандартний\" обробник. В правій панелі напишіть:<br />
	join #kvirc<br />
	join #kde-users<br />
	join #якиськанал<br />
	....<br />
	Натисніть Гаразд, все готово: ви щойно створили обробник події.<br />
	Перез'єднайтесь з сервером і KVIrc автоматично зайде на вказані канали";
$template['faq']['text4b3']="
	Іншим варіантом (кращий, якщо ви використовуєте кілька серверів) є зайти на сторінку параметрів сервера і натиснути кнопку 'Розширені' на записі для певного сервера.<br />
	Існує специфічна для сервера подія \"Виконати при з'єднанні...\" ";
$template['faq']['text5a']="Інколи KVIrc працює повільно під Windows";
$template['faq']['text5b']="
	Це зазвичай спричинене важкою графікою: спробуйте вимкнути такі ефекти як псевдопрозорість. Помічено, що це найчастіше трапляється на 32-бітних дисплеях. Може допомогти перемикання на 16 чи 24-бітне зображення";
$template['faq']['text6a']="Як приєднатись до IRC-сервера через SSL";
$template['faq']['text6b1']="Спробуйте";
$template['faq']['text6b2']="Це також має працювати через IPv6.<br />
	Якщо не працює, то можливо ваш виконуваний файл не має підтримки SSL.<br />
	Щоб дізнатись це наберіть";
$template['faq']['text6b3']="в командному рядку KVIrc. Якщо в списку немає \"SSL\" тоді поверніться на стадію компіляції щоб знайти причину";
$template['faq']['text7a']="Як використовувати DCC через SSL";
$template['faq']['text7b']="має спрацювати";
$template['faq']['text8a']="Мені потрібен сертифікат SSL";
$template['faq']['text8b']="Ні, вам його не треба, але якщо хочете ви можете його використовувати";
$template['faq']['text9a']="Як мені створити сертифікат SSL";
$template['faq']['text9b']="
	Тестовий самопідписаний сертифікат можна створити скриптом CA.pl на Perl, який включений в пакунок OpenSSL. Він буде виглядати приблизно як";
$template['faq']['text10a']="Я не можу змусити KVIrc використовувати мій сертифікат SSL в DCC";
$template['faq']['text10b']="
	Протокол SSL не вимагає щоб \"клієнт\" висилав сертифікат: він висилається лише якщо \"сервер\" дає на нього запит (це має відношення до KVIrc).<br />
	Сервер може мати сертифікат і ви можете задати його на сторінці опцій SSL.<br />
	Якщо ваш Приватний Ключ зберігається в файлі сертифікату вкажіть ту ж назву файлу і для сертифікату і для Приватного Ключа.<br />
	Не забудьте вказати пароль при необхідності";
$template['faq']['text11a']="KVIrc ламається при використанні сертифікату під Windows";
$template['faq']['text11b']="
	Це швидше за все помилка в SSL dll, що йде разом з версією KVIrc для windows.<br />
	Спробуйте іншу версію цього dll";
$template['faq']['text12a']="/me не підтримує символ '\$' ";
$template['faq']['text12b']="
	Це НЕ баг : це можливість : kvirc підтримує (і підміняє!) змінні в усіх командах. Символ $ можна ввести використавши задню косу риску: /me досягнув \\\$100 спрацює вірно";
$template['faq']['text13a']="/me не підтримує '&quot;' (подвійні лапки)";
$template['faq']['text13b']="
	Це НЕ баг : це можливість : радок, включений в подвійні лапки, збереже свої пробіли, коли інші рядки будуть мати спрощені пробіли. Це стосується ВСІХ команд.<br />
	Ви можете ввести символ &quot; використавши задню косу риску: /me почувається \\\"foo\\\" спрацює вірно";
$template['faq']['text14a']="/me не може містити символ ';' ";
$template['faq']['text14b']="
	Це НЕ баг : це можливість : kvirc підтримує введення кількох команд в одному рядку і використовує ';' як роздільник команд. Ви можете ввести символ ';' використавши задню косу риску: /me голодний \;) спрацює вірно";
$template['faq']['text15a']="Я більше не бачу спливаючих меню каналу";
$template['faq']['text15b']="
	Якщо з налаштуваннями KVIrc щось пішло не так (крах при збереженні параметрів скрипта ?) або якщо ви наламали дров з параметрами скрипта і хочете повернути все як було (скрипт за замовчуванням) виберіть \"Скриптування/Відновити стандартний скрипт\" в меню KVIrc.<br />
	(<b>УВАГА:</b> Всі ваші зміни до скрипта будуть втрачені!)";
$template['faq']['text16a']="
	При компіляції я отримую такі помилки:<br />
	&nbsp; &nbsp; В фалі [якисьфайл]:[якисьрадок] внутрішня помилка:<br />
	&nbsp; &nbsp; Помилка сегментації<br />
	&nbsp; &nbsp; Будь ласка надішліть повний звіт про помилку,<br />
	&nbsp; &nbsp; з відповідним обробленим кодом.<br />
	&nbsp; &nbsp; Дивіться &lt;URL:http:...";
$template['faq']['text16b1']="Ця помилка може мати кілька причин";
$template['faq']['text16b1a']="
	Баг в компіляторі: GCC 3.2 20020903 (стандартний на RH 8.0) падає 5-6 разів за день. Зазвичай допомагає перезапуск команди \"make\".<br />
	Якщо це не допомагає чи крах трапляється дуже часто і дратує, спробуйте оновити компілятор";
$template['faq']['text16b1b']="
	Псування пам'яті: це трапляється дійсно часто: одна з ваших плат пам'яті інколи ріже довільні байти пам'яті. Зазвичай це стається через сильне завантаження системи (наприклад компіляція ядра, KDE чи kvirc). Ви можете перевірити пам'ять спробувавши різні модулі пам'яті (або виймаючи плати одна за одною послідовно щоб виявити пошкоджену). Такод можна спробувати програму memtest і патч ядра для ігнорування зламаних ділянок пам'яті (задавши ядру фіксовану ділянку для порожнього завдання).<br />
	Ці інструменти можна знайти в Інтернеті вашим улюбленим пошуковиком";
$template['faq']['text16b1c']="
	Глибока проблема заліза: якщо оновлення компілятора та заміна пам'яті не допомагає, тоді це *можуть* бути глибокі проблеми з залізом: помилки шини , глючний контролер IDE (чи SCSI) чи навіть бракований ЦП... Ось так";
$template['faq']['text17a']="KVIrc падає при вводі URL в вікно виводу";
$template['faq']['text17b']="
	Причина може ховатись в модулі URL: ми шукаємо причину.<br />Спробуйте";
$template['faq']['text18a']="KVIrc падає коли відкрите введення багаторядкового тексту (або в центрі скриптів)";
$template['faq']['text18b']="
	Якщо ви встановили нову версію KVIrc поверх попередньої або якщо ви змінили бібліотеки Qt, до яких прив'язаний KVIrc тоді це може бути через зламану конфігурацію багаторядкового редактора.<br />
	Спробуйте видалити \$HOME/.kvircssexeditorrc і перезапустіть KVIrc";
$template['faq']['faqonwiki']="There is another set of frequently asked questions on <a href=\"https://github.com/kvirc/KVIrc/wiki/FAQ\">the wiki</a>.";

/* faq.php end */

/* features.php start */
$template['features']['title']="Можливості";
$template['features']['text1']="
	Гмм.. перелік можливостей KVIrc ?<br />
	А... чому б і ні ?<br />
	Ось наведені ключові можливості що спадають на думку.";
$template['features']['tree1']="Інтерфейс користувача";
$template['features']['tree1a']="Повне налаштування через графічний інтерфейс";
$template['features']['tree1b']="Плаваючі MDI вікна";
$template['features']['tree1c']="Вбудований оглядач довідки";
$template['features']['tree1d']="Підтримка тем (всі налаштовувані через Інтерфейс чи скрипти)";
$template['features']['tree1e']="Підтримка превдопрозорості (включаючи стільницю в KDE)";
$template['features']['tree1f']="Редагування панелей через Drag &amp; Drop";
$template['features']['tree1g']="Сповіщувач активності";
$template['features']['tree1h']="Панель стану з підтримкою Аплетів";
$template['features']['tree1i']="Мітка непрочитаного тексту";
$template['features']['tree1j']="Переклад 14-ма мовами";
$template['features']['tree2']="Мережа";
$template['features']['tree2a']="Підтримка проксі (SOCKSv4, SOCKSv5, HTTP)";
$template['features']['tree2b']="Повна підтримка IPv6 (також для передач DCC)";
$template['features']['tree2c']="Підтримка SSL (також через IPv6)";
$template['features']['tree2d']="Підтримка шифрування";
$template['features']['tree3']="Ядро";
$template['features']['tree3a']="
	Модульна архітектура: не дуже часто використовувані функції знаходяться в зовнішніх модулях і завантажуються лише коли необхідно";
$template['features']['tree3b']="Розширюваність: величезне API для написання модулів розширень";
$template['features']['tree3c']="Підтримка Юнікоду";
$template['features']['tree4']="IRC";
$template['features']['tree4a']="Мультисерверне з'єднання";
$template['features']['tree4b']="Списки сповіщення (так, WATCH підтримується)";
$template['features']['tree4c']="Списки ігнорування";
$template['features']['tree4d']="База зареєстрованих користувачів";
$template['features']['tree4e']="Замір відставання";
$template['features']['tree4f']="Налаштовуване журналювання";
$template['features']['tree4g']="Підтримка стандартних DCC CHAT та SEND (з продовженням)";
$template['features']['tree4h']="Розширені типи DCC: VOICE, RSEND, GET, RECV";
$template['features']['tree4i']="DCC CHAT через SSL";
$template['features']['tree4j']="Обмеження пропускної здатності DCC (можливість встановити її \"на льоту\")";
$template['features']['tree5']="Скриптування";
$template['features']['tree5a']="Вбудований інтерпретатор скриптової мови";
$template['features']['tree5a1']="скаляри, масиви та хеші...";
$template['features']['tree5a2']="псевдоніми";
$template['features']['tree5a3']="сповіщення";
$template['features']['tree5a4']="події";
$template['features']['tree5a5']="скриптові панелі";
$template['features']['tree5a6']="підтримка Perl";
$template['features']['tree5a7']="Можливість перекладу скриптів (з допомогою функції tr() )";
$template['features']['tree5b']="
	Підтримка об'єктів в скриптовій мові: так, тепер ви можете використовувати <acronym title=\"Об'єктно Орієнтоване Програмування\">ООП</acronym>";
$template['features']['text2']="Гмм...Напевно досить щоб вас зацікавити :D";
/* features.php end */

/* help.php start */
$template['help']['title']="Пошук допомоги";
$template['help']['text1']="
	Якщо у вас виникли проблеми з KVIrc спершу відвідайте списки розсилки.";
$template['help']['text2']="
	Якщо щось йде погано, або у вас виникли питання, пропозиції, або ви просто зацікавлені розробкою KVIrc, заходьте на";
$template['help']['text3']="
	Розробники слідкують за списком розсилки і дадуть вам відповідь як тільки зможуть.";
$template['help']['text4a']="Офіційний канал підтримки KVIrc знаходиться в";
$template['help']['text4b']="мережі Freenode";
$template['help']['text4c']="а канал має очевидну назву";
$template['help']['text4d']="Офіційний Італійський канал - ";
$template['help']['text4e']="в";
$template['help']['text4f']="мережі Azzurra";
$template['help']['text4g']="Також можна заглянути в";
$template['help']['text4h']="мережу IRCNet";
$template['help']['text4i']="на канал";
$template['help']['text4j']=":)";
$template['help']['text5']="Баги можна звітувати та переглядати з допомогою";
$template['help']['text6']="
	Пропозиції, новини, виправлення та все інше, пов'язане з сайтом кидайте на пошту сюди";
$template['help']['text7']="
	Для допомоги з графікою, перекладами, та документацією зв'язуйтесь з";
/* help.php end */

/* honor.php start */
$template['honor']['title']="Честь і Слава";
$template['honor']['text1']="Тут приведений список людей, які якимось чином допомогли проекту KVIrc.";
$template['honor']['text2']="Цей список далеко не повний. Багато більше чи менше \"невідомих\" людей витрачали їхній час, очі, інтернет і мозок задля цього проекту. Якщо ви один з них, напишіть на";
$template['honor']['text3']="Якщо ваш аватар не з'являється, чи він невірний, пришліть мені вірну картинку. Якщо ви знайшли помилку, зламані посилання, чи на сторінці щось відсутнє, киньте лист на";
$template['honor']['made1']="\"Творець\" KVIrc. Розумова робота, ручна робота, псування очей і пиття кави";
$template['honor']['quote1']="Я перевірю... дай глянути...&quot;<br />&quot;Я виправлю це завтра...&quot;<br />&quot;KVIrc: клієнт, який не вміє робити каву";
$template['honor']['made2']="Вебмайстер, шукач багів, куратор знімками, support gay^Wguy :o) і людина, яка надала підтримку IPv6";
$template['honor']['made3']="Документація, пошук багів, публічні відносини";
$template['honor']['quote3']="Без поняття про що ти кажеш... чи нащо воно тобі треба :)";
$template['honor']['made4']="Пошук багів, розробка плагінів, виправлення, перенесення на windows та знімки";
$template['honor']['quote4']="&lt;YaP&gt; чому ти реалізував клас, як наприклад Зробивсесам ? :)&quot;<br />&quot;&lt;Pragma&gt; чудова рекурсивна функція :)&quot;<br />&quot;&lt;YaP&gt; Дідько...Я так і знав, хехехе";
$template['honor']['made5']="Тестовий скриптер, натхненник пошуку багів &amp; автор першого сайту www.kvirc.net";
$template['honor']['quote5']="whassup?";
$template['honor']['made6']="Автор офіційного керівництва з C++ та розробник плагінів";
$template['honor']['quote6']="приготуйся..&quot; &quot; #include &lt;iostream.h&gt;&quot;<br />&quot;class testing {...&quot;<br />&quot;&lt;oehansen&gt; Мушу визнати, я спантеличений :-)&quot;<br />&quot;&lt;Pragma&gt; Я теж , на даному етапі :)";
$template['honor']['made7']="Пакунки для Slackware";
$template['honor']['made8']="Переклад на Італійську, пошук багів, моральна підтримка :))))";
$template['honor']['quote8']="KVIrc? Аа! Динозавр...";
$template['honor']['made9']="Німецький переклад, пошук помилок, нові ідеї. Скрипти, Покращення коду + новий код ;)";
$template['honor']['quote9']="Pragma: Коротке питання...";
$template['honor']['made10']="Ламає все і виправляє граматику, коли вже немає що ламати. Також прислуховується до запитів Aeri і виконує половину з них...";
$template['honor']['quote10']="Ей, в мої обов'язки не входить пошук моїх кумедних цитат ^_~";
$template['honor']['made11']="Італійські переклади, покращення коду та багато корисних пропозицій";
$template['honor']['made12']="Офіційний постачальник польського пива та розробник плагінів";
$template['honor']['quote12']="echo &quot;ПЕРЕСТАНЬ&quot; &gt; /dev/neighbour&quot; &quot;cd ./neighbour &amp;&amp; make clean&quot;<br />&quot;Pragma...гмм...баги ? ЯКІ баги ? ;))";
$template['honor']['made13']="Автор старого сайту, деякі пропозиції, чаєпитець (Дякую Szymon, твій чай чудовий ;) ) і.. чому я в списку?";
$template['honor']['quote13']="Мамо дивись!! Моє ім'я в списку Честь і Слава KVIrc!!";
$template['honor']['made14']="Автор новин, шукач багів і постійна підтримка користувачів на #kvirc";
$template['honor']['made15']="Французький переклад, бетатестування і полювання на баги";
$template['honor']['made16']="Розробник об'єктних класів, покращення коду, бетатестування, виправлення, екзотичне скриптування, документація...";
$template['honor']['quote16']="&lt;Grifisx&gt;...довбані дужки ! ...їх завжди забагато...<br />&lt;Noldor&gt;....або замало...";
$template['honor']['made17']="Розробник об'єктних класів, покращення коду, бетатестування, виправлення, екзотичне скриптування, документація...";
$template['honor']['quote17']="&lt;Grifisx&gt; Відмінність між тобою і мною в тому, що Ти бачиш речі і кажеш &quot;Чому?&quot; а я мрію про речі яких ніколи не було і кажу...&quot;Чому б і ні?";
$template['honor']['made18']="Інтернаціоналізація, виправлення, пошук помилок, нові ідеї та інше...";
$template['honor']['made19']="Автор нового сайту, координатор сайту, Італійський переклад, скриптування, пошук помилок, пакунки для Slackware, нові ідеї...";
$template['honor']['quote19']="&lt;HelLViS69&gt; Священний gdb, в ім'я ritchie, kerningham та rms";
$template['honor']['made20']="Італійський переклад, графіка, вірний послідовник";
$template['honor']['quote20']="Час не має сенсу";
$template['honor']['made21']="ЧаПи та Італійські переклади";
$template['honor']['made22']="Пакунки для Debian, моральна підтримка";
$template['honor']['quote22']="Треба стати вище людства силою, висотою душі - презирством. - Фрідріх Ніцше";
$template['honor']['made23']="Пошук та виправлення багів, виправлення документів, скриптування (Файловий сервер NGL)";
$template['honor']['quote23']="Я не знаю чого я хочу, але я знаю як це отримати.";
$template['honor']['made24']="Система Відсутності, кольорові ніки, загальне програмування, Іспанський переклад";
$template['honor']['quote24']="Pragma: думай про KVIrc як про інструмент для скриптування... ми маємо залишити їм якусь роботу :)";
$template['honor']['made25']="'Світло' поміж хмар GNU. Родовий (??!) офіційний прихильник проекту :)";
$template['honor']['quote25']="Pragma: схоже kvirc з всіма плагінами стає оточенням робочого столу&quot; &quot;echo espresso &gt; /dev/coffee&quot; &quot;Pragma: ви досягли межі користувачів. Що за!";
$template['honor']['made26']="Автор ідеї для www.kvirc.org";
$template['honor']['quote26']="Цей вільний проект кращий за шароварний&quot; &quot;mIrc для windows в стадії альфа";
$template['honor']['made27']="Слідкує щоб ніхто не сачкує, мисливець за багами, ДУЖЕ багато пропозиції і автор RealityX IRC.";
$template['honor']['quote27']="Стрибки з парашутом майже так само захопливі як скриптування для KVIrc!&quot;<br />&quot;Pragma: можеш додати такі функції: \$rubmyback() та \$makecoffe()?";
$template['honor']['made28']="Налагодження та покращення.";
$template['honor']['quote28']="Я роблю речі просто *дуже* добре, коли я не маю уявлення що я роблю";
$template['honor']['made29']="Покращення коду KVIrc та моїх знань про linux. Я люблю думати про нього як про 'духовного наставника'... :D";
$template['honor']['made30']="KDE-чувак! Підтверджує те, що KVIrc має право мати букву K на початку";
$template['honor']['quote30']="Можна зробити KVIrc програмою лишя під KDE?? Будь лаааска...";
$template['honor']['made31']="Деякі \"крихітні\" частини коду.";
$template['honor']['quote32']="&lt;Error403&gt;Number1: Я уявив тебе божевільним :)&quot;<br />&quot;&lt;NumeroUno&gt; Я був п'яний";
$template['honor']['made33']="\"Відкрита рука\" для проекту KVIrc. Забезпечує сервіс SVN, WWW &amp; FTP дзеркалювання, інтернет, великі ідеї і веселість при написанні коду.";
$template['honor']['made34']="Мисливець за помилками, джерело ідей :)";
$template['honor']['quote34']="купи поштового голуба і перешли DCC-передачі через нього";
$template['honor']['made35']="Різні лякливі покращення.";
$template['honor']['quote35']="Я може запрограмувати все що задумав!";
$template['honor']['made36']="Бетатестування, покращення мовної структури.";
$template['honor']['quote36']="...на землі досить 100 IP на один метр, щоб кожен вмикач світла мав свій IP...тоді ти можеш послати вимикачеві команду через telnet і вимкнути його!";
$template['honor']['made37']="Перенесення під OS X";
$template['honor']['made38']="Португальський переклад, патчі для основного скрипта і збирання пакунків для Mandriva (MDE).";
$template['honor']['made39']="Російський переклад";
$template['honor']['made40']="Виправлення, код, порт під mingw32, підтримка користувачів";
$template['honor']['made41']="Керівник перенесення під FreeBSD";
$template['honor']['quote37']="FreeBSD Gimp.";
/* honor.php end */

/* install.php start */
$template['install']['title1']="Встановлення";
$template['install']['title2']="Мінімальні вимоги";
$template['install']['title3']="Налаштування оточення";
$template['install']['title4']="Інтерактивний режим";
$template['install']['title5']="Збирання";
$template['install']['title6']="Збирання на OS X";
$template['install']['title7']="Збирання на Win32";
$template['install']['title8']="Встановлення на рівні хакера";
$template['install']['title9']="Створення пакунку KVIrc";
$template['install']['title10']="Удачі!";
$template['install']['text1']="Загальні вказівки щодо встановлення KVIrc версії 4.0";
$template['install']['text2']="Щоб скомпілювати KVIrc 4.0 вам знадобляться наступні програми";
$template['install']['text3']="
	Якщо у вашому дистрибутиві встановлено KDE, то Qt встановлений також. Якщо ні, просто встановіть qt4 з репозиторію.";
$template['install']['text4']="
	Перед стартом cmake переконайтесь, що змінна оточення \$QTDIR вказує на вірне місце. ЦЕ допоможе визначити правильну версію Qt.";
$template['install']['text5a']="Зрештою ви можете задати її командою";
$template['install']['text5b']="ваша тека qt";
$template['install']['text6']="На моїй системі qt встановлений в /usr/lib64/qt тому я виконую";
$template['install']['text7']="Щоб перевірити чи у вас потрібна версія Qt, запустіть";
$template['install']['text8']="Моя система видає результат";
$template['install']['text9']="
	Якщо у вас встановлено кілька версій Qt4 і ви хочете використати певну в них, експорту QTDIR невистачить. Оскільки модуль CMake, що шукає Qt4, використовує qmake, щоб визначити теку з бібліотеками Qt4 ви можете додати до вашого PATH шлях до потрібної версії qmake, щоб CMake його використав";
$template['install']['text10']="
	Зауважте, що компілювання з ввімкненою підтримкою KDE4 змусить kvirc лінкуватись на версію Qt4, яку використовує KDE4, і це може призвести до проблем з лінкуванням. Вимкнення підтримки KDE4 є єдиним виходом на даний момент.<br />
	Зверніть увагу що вам доведеться перевизначити бібліотеки Qt, що використовуються при роботі KVIrc";
$template['install']['text11']="
	Він зазвичай включене в останні дистрибутиви.<br />
	Щоб дізнатись який ви маєте cmake просто виконайте";
$template['install']['text12']="
	Вам потрібен хороший компілятор C++. Під linux це зазвичай gcc з інтрументів GNU. Рекомендуємо використовувати gcc 4.3.<br />
	Щоб дізнатись версію gcc виконайте";
$template['install']['text13']="
	Він зазвичай включений в ваш дистрибутив і напевне вже встановлений. Бібліотека має назву libpthread.so.<br />
	Можете пошукати її командою \"find\" ";
$template['install']['text14']="
	Якщо у вас його немає (CMake вам про це скаже) ви можете завантажити його з улюбленого дзеркала GNU.<br />
	Скрипт конфігурації також не завершиться успішно якщо бібліотека схована десь в вашій системі (напр. не в /lib , /usr/lib чи /usr/local/lib): перемістіть її.";
$template['install']['text15']="
	Вам потрібна бібліотека інтерфейсу динамічного зв'язування libdl.so.<br />
	Вона зазвичай встановлена в вашій системі, тому забудьте про неї поки про неї не спитає копфігуратор. В деяких системах інтерфейс вбудований libc.";
$template['install']['text16a']="
	Якщо ви хочете зібрати програму з підтримкою інтеграції в KDE вам очевидно потрібен KDE.<br />
	Пакунку kdelibs має вистачити.</p>
	<p>Тому перед стартом cmake переконайтесь що змінна оточення \$KDEDIR вказує на вірне місце.</p>
	<p>Зрештою його можна задати командою";
$template['install']['text16b']="ваша тека kde";
$template['install']['text17']="В моєму випадку KDE встановлений в /usr тому я використовую";
$template['install']['text18']="
	Якщо ви хочете щоб працювала не лише англійська версія програми, тоді вам потрібен пакунок GNU gettext. Якщо бути точним, KVIrc використовує програму msgfmt.</p>
	<p>Він зазвичай включений в ваш дистрибутив і напевне вже встановлений. Можете перевірити виконавши";
$template['install']['text19']="
	KVIrc не поскаржиться якщо вищевказана програма відсутня: просто він пропустить створення мовних файлів.<br />
	Якщо вищевказана команда не працює, тоді вам треба встановити пакунок gettext (якщо вам потрібна підтримка не-англійської мови).";
$template['install']['text20']="
	Якщо вам потрібна підтримка шару захищеного сокету (SSL) вам необхідна бібліотека OpenSSL і файли заголовків (libssl.so та openssl/ssl.h).";
$template['install']['text21']="
	Якщо ви хочете генерувати онлайн документацію тоді вам потрібен Perl: підійде будь-яка версія (напевне).";
$template['install']['text22']="
	Якщо вам потрібна підтримка скриптування Perl тоді вам потрібно повністю встановити Perl. Ваша libperl.so ПОВИННА бкти зібрана з параметром MULTIPLICITY.<br />
	Можете перевірити це командою perl -V<br />
	Принцип вбудовування Perl в зовнішні програми змінився від версії Perl 5.8 до 5.10; KVIrc повинен нормально працювати з Perl >= 5.004, але рекомендуємо 5.10, оскільки майбутні оновлення можуть зламати сумісніть.";
$template['install']['text23']="
	Якщо вам потрібна, щоб DCC VOICE підтримував кодек GSM, вам потрібна остання версія libgsm.<br />
	Це є необов'язковою вимогою в процесі збирання оскільки KVIrc шукатиме бібліотеку при запуску, і лише якщо йде запит на DCC VOICE з кодеком GSM.<br />
	Можете пошукати libgsm командою \"find\" ";
$template['install']['text24']="
	Ця бібліотека включена в більшість дистрибутивів. Деякі дистрибутиви містять лише статичні версії бібліотеки \"libgsm.a\": якщо попередній пошук повернув щось накшталт \"/usr/lib64/libgsm.a\", вам напевне доведеться створити спільний архів вручну виконанням";
$template['install']['text25']="
	Якщо він не встановлений у вас взагалі, гляньте на СД-диск вашого дистрибутиву, або завантажте його з інтернету";
$template['install']['text26']="
	Якщо ви хочете щоб плагін /snd програвав різні формати аудіо вам потрібна запущена система як phonon, запущений демон звуку як esd чи досить свіжа бібліотека audiofile. Без цього KVIrc зможе відтворювати лише файли типу *.au.";
$template['install']['text27a']="
	Починаючи з версії 4.0 KVIrc викоирстовує систему збирання CMake, вона потрібна для створення файлів правил Makefile для програми make.<br />
	Щоб це зробити ми радимо збирання типу \"out-of-source\": збирайте всі файли за межами теки з початковим кодом.";
$template['install']['text27b']="ваші опції";
$template['install']['text28']="
	Таким чином ви створили оточення за-межами-коду в порожній робочій теці.<br />
	Зауважте що кінцеві точки необхідні інакше cmake НЕ створить правильне оточення.";
$template['install']['text29']="
	Правила CMake підтримують певні прапорці. Якщо ви їх не вкажете, CMake спробує сам створити хороше оточення :)<br />
	Щоб використовувати ці прапорці, ви повинні вказати булеву величину або рядок.</p>
	<p>Наприклад, щоб встановити в /usr замість /usr/local і вимкнути підтримку Phonon, команда буде наступною";
$template['install']['text30']="Нижче наведений список з поясненнями";
$template['install']['tree0']="
	Якщо ввімкнено, компілює виконуваний файл з налагоджувальними символами.<br />
        Корисно для звітування помилок.";
$template['install']['tree1']="
	Доступно лише коли налагодження вимкнено, цей прапор вимикає зачистку об'єктів перед встановленням.<br />
	(Зачистка об'єктів відкидає символи з об'єктних файлів, зменшуючи їх розмір на диску, за рахунок більш складного або неможливого налагодження.)";
$template['install']['tree2']="Генерує багатий вивід при компілюванні.";
$template['install']['tree3']="Встановить всі дані в теку /path";
$template['install']['tree4']="
	Встановить модулі libkvilib та kvirc в теку \${CMAKE_INSTALL_PREFIX}/lib\${LIB_SUFFIX}. Він скидається до порожнього суфіксу. В основному для 64-бітних систем (-DLIB_SUFFIX=64).";
$template['install']['tree5']="Встановить сторінки man до DIRECTORY.";
$template['install']['tree6']="
	Якщо ввімкнено, додає дані про версію до kvirc та libkvilib, тому різні версії KVIrc можуть співіснувати в одній системі.";
$template['install']['tree7']="
	Якщо ввімкнено, правила встановлення KVIrc не зададуть CMAKE_C(XX)_FLAGS. Замість цього це дозволить CMake використати дані зі змінних оточення.<br />
	Ввімкнення цього прапорця перевизначить значення -DWANT_DEBUG.";
$template['install']['tree8']="
	Це перевизначить шлях встановлення до доброго стандартного.<br />
	Наступні компіляції повинні використовувати правильне значення шляху з кешу CMake.<br />
	Цей прапорець корисний для вирішення проблем встановлення під OS X.";
$template['install']['tree9']="
	Вмикає чи вимикає компілювання універсальних бінарників для платформи OS X.";
$template['install']['tree10']="Вмикає чи вимикає підтримку звукового бекенду Phonon.";
$template['install']['tree11']="
	Вмикає чи вимикає підтримку звукового бекенду OpenSoundSystem.<br />
	Якщо вимкнено, підтримка Audiofile буде вимкнена також";
$template['install']['tree12']="Вмикає чи вимикає підтримку звукового бекенду Audiofile.";
$template['install']['tree13']="Вмикає чи вимикає підтримку звукового бекенду ESounD.";
$template['install']['tree14']="Вмикає чи вимикає підтримку Qt-DBus.";
$template['install']['tree15']="Вмикає чи вимикає підтримку Qt-WebKit.";
$template['install']['tree16']="Вмикає чи вимикає підтримку KDE4.";
$template['install']['tree17']="
	Вмикає чи вимикає підтримку функцій шифрування OpenSSL.";
$template['install']['tree18']="
	Вмикає чи вимикає підтримку функцій шифрування Crypto++.<br />
	Заміняє вбудовані копії тестованою бібліотекою widley.";
$template['install']['tree19']="
	Вмикає чи вимикає шифрувальні машини і всю підтримку шифрувальної/текстової трансформації. Створює трохи менший файл програми";
$template['install']['tree20']="
	Вмикає чи вимикає підтримку IPv6.<br />
	Якщо у вас просте IPv4-з'єднання, ви можете зберегти підтримку IPv6: ви змоете опитувати хости IPv6.";
$template['install']['tree21']="
	Ця опція вмикає чи вимикає підтримку псевдо та простої прозорості.<br />
	Підтримка псевдопрозорості робить вікна KVIrc напівпрозорими (це НЕ справжня прозорість: це просто гарний хак). Прозорість використовує компонування і потребує правильної підтримки залізом.<br />
	Якщо підтримка KDE ввімкнена, KVIrc буде мати опцію використання вікнами побляклої стільниці KDE. Без підтримки KDE ви зможете вибрати фальшивий фон. (Ви все ще можете вибрати шпалери з вашої стільниці: це буде працювати (краще чи гірше) у всіх менеджерах вікон).<br />
	Це має гарний вигляд але зазвичай їсть більше пам'яті і робить файл програми трохи більшим. Особливо при переміщенні ЦП може підвисати.<br />
	Таким чином тут можна вимкнути прозорість.";
$template['install']['tree22']="
	Вмикає чи вимикає підтримку Perl.<br />
	Ви не зможете використовувати скрипти на Perl всередині KVIrc.<br />
	Ви все ще можете виконувати скрипти на Perl за межами KVIrc, тобто командою exec().<br />
	Зауважте що підтримка Perl буде перевірятись все одно, і використовуватись для генерування документації (якщо така є).";
$template['install']['tree23']="
	Вмикає чи вимикає підтримку python.<br />
	Ви не зможете використовувати скрипти на python всередині KVIrc.";
$template['install']['tree24']="
	Вмикає чи вимикає підтримку міжпроцесної взаємодії.<br />
	Ви не зможете посилати команди віддалено для запуску сесій KVIrc: це в основному означає що при кожному запуску KVIrc буде відкриватись новий сеанс.<br />
	Якщо ви не використовуєте цей перемикач, новий сеанс буде створюватись лише якщо немає активних сеансів на тому ж дисплеї чи \"новий сеанс\" був примусово запущений командним перемикачем.<br />
	Якщо сеанс вже запущено, до цього сеансу буде переданий командний рядок через IPC (X-основана-на-подіях взаємодія).<br />
	Ця опція заощаджує кілька KБ виконуваного файлу KVIrc, тому якщо вам дійсно не вистачає пам'яті, використайте її, інакше IPC є гарною властивістю.";
$template['install']['tree25']="
	Вмикає чи вимикає використання GetText для генерування файлів перекладу.";
$template['install']['tree26']="Вмикає чи вимикає генерування розробницької документації через Doxygen.";
$template['install']['tree27']="
	Вмикає чи вимикає використання бібліотеки GSM. Це вимкне кодек DCC VOICE GSM але може допомогти коли компілювання не вдається через щось спільне з GSM :)";
$template['install']['tree28']="
	Під Solaris реалізації usleep() та ниток основані на SIGALARM. KVIrc використовує обидва і це може призвести до непередбачуваних виходів з KVIrc. Ця опція вмикає обхід для цієї проблеми.";
$template['install']['tree29']="
	Вмикає чи вимикає підтримку звуку DCC VOICE. Це може допомогти якщо у вас проблеми з компілюванням src/modules/dcc/voice.cpp.<br />
	Це вимкне підтримку звуку (і зробить DCC VOICE даремним).";
$template['install']['tree30']="Вмикає чи вимикає ЕКСПЕРИМЕНТАЛЬНУ підтримку DCC VIDEO.";
$template['install']['tree31']="Вмикає чи вимикає ЕКСПЕРИМЕНТАЛЬНУ підтримку Ogg/Theora для DCC-відео.";
$template['install']['tree32']="Вмикає чи вимикає ЗАСТАРІЛУ підтримку DCC CANVAS.";
$template['install']['tree33']="
	Вмикає чи вимикає профілювання виділення пам'яті.<br />
	Не задавайте його якщо ви не розробник і не знаєте що робите.<br />
	Це буде мати великий вплив на розмір виконуваного файлу і особливо швидкість.<br />
	Не використовуйте це.";
$template['install']['tree34']="
	Вмикає чи вимикає перевірки пам'яті malloc(). Буде виводитись гарне повідомлення якщо в системі закінчується пам'ять.<br />
	Це не вбереже вас від придбання нової ОЗУ, але ви хоча б будете знати що в системі мало вільної пам'яті і це не провина KVIrc.<br />
	Більшість систем зазвичай повідомляють вас коли закінчується вільна оперативна пам'ять (напр. Linux та OOM killer.)<br />
	Швидше за все вам не потрібно вмикати цей прапорець.";
$template['install']['tree35']="
	Вручну вказати номер ревізії якщо в системі не знайдений subversion.<br />
	Це зазвичай корисне під windows.<br />
	Будь ласка не вказуйте тут непотрібні дані, оскільки це зробить налагодження важчим і нікто від цього не виграє.";
$template['install']['tree36']="І трохи піци на обід :)";
$template['install']['tree37']="І трохи пивка в чаті :)";
$template['install']['tree38']="
	QGtkStyle є бекендом QT що використовує рідні віджети Gtk. В останніх версіях Gtk зроблені деякі божевільні кроки і їх неможливо обійти (приклад: значки не можна відображати в меню, колір фону мітки фіксований).<br />
	За замовчуванням ми вимикаємо QGtkStyle оскільки він не дружить з вбудованим двигуном тем KVIrc і створює проблеми (наприклад білий текст на білому фоні).<br />
	Деякі користувачі все одно хочуть його використовувати і інколи ми перевіряємо чи розробники GTK вже докурили конопельку, тому ця опція дозволить ввімкнути двигун QGtkStyle.<br />
	Будь ласка не повідомляйте ні про які баги з темами якщо ви ввімкнули цю опцію: ми знаємо що воно зламане, але ніхто не буде це поправляти.";
$template['install']['text31']="
	Система CMake також забезпечує режим інтерактивного конфігурування середовища перед компілюванням.<br />
	І знову, ми радимо збирання \"out-of-source\": збирання всіх фалів без засмічування теки з початковим кодом.";
$template['install']['text32']="
	Тепер, коли ви знаходитесь в інтерактивному режимі, використайте інструкції з екрану для конфігурування середовища збирання.";
$template['install']['text33']="Цей крок простий :)<br />Перехрестіть пальці і виконайте";
$template['install']['text34']="
	Якщо ваш make є не від GNU (наприклад під FreeBSD) використовуйте замість нього \"gmake\" .<br />
	Процес компілювання займе від 3-4 хвилин до годин залежно він можливостей комп'ютера та його завантаження.<br />
	Якщо у вас повільний ЦП але ви маєте кілька комп'ютерів в локальній мережі ви можете скористатись distcc для паралельного збирання.</p>
	<p>після завершення компілювання виконайте";
$template['install']['text35']="
	Як і вище: використайе \"gmake install\" якщо ваш make не від GNU.</p>
	<p>Це встановить програму в теку /usr/local/bin (якщо ви не вказали інше параметром -DCMAKE_INSTALL_PREFIX в правилах cmake), бібліотеки в /usr/local/lib (якщо ви не вказали інше параметром -DLIB_SUFFIX в правилах cmake) та спільні дані в /usr/local/share/kvirc.</p>
	<p>Переконайтесь що /usr/local/lib є в списку файлу /etc/ld.so.conf , а якщо ні, то виконайте";
$template['install']['text36']="
	Якщо ви вирішили використовувати підтримку KDE встановлення може встановити всі ці файли до вашого дерева \$KDEDIR замість /usr/local.<br />
	В такому випадку не переймайтесь, оскільки KDE вимагає, щоб його тека з бібліотеками була в /etc/ld.so.conf";
$template['install']['text37']="
	Існує інструкція для збирання та встановлення для систем OS X. Вона розміщена в теці doc/ . Вона називається INSTALL-MacOS.txt";
$template['install']['text38']="
	Існує інструкція для збирання та встановлення для систем Win32. Вона розміщена в теці doc/ . Вона називається INSTALL-Win32.txt";
$template['install']['text39']="
	CMake підтримує параметр DESTDIR.<br />
	Тому якщо ви хочете створити пакунок для вашого дистрибутиву, ви повинні вказати це на етапі \"make install\": результуючі файли будуть збережені у вказану теку.<br />
	Синтаксис наступний";
$template['install']['text40']="
	Після цього кроку виконайте правила, що вимагає ваш дистрибутив для створення пакунку.</p>
	<p>Також ви можете спробувати експериметальну підтримку CPack, що включена в CMakeLists.txt для збирання пакунків: в цьому випадку зверніться до документації CPack.";
$template['install']['text41']="Ось і все, друзі.";
/* install.php end */

/* license.php start */
$template['license']['title']="Ліцензія KVIrc";
$template['license']['text']="KVIrc є вільним ПЗ: він випущений під розширеною версією General Public License.";
$template['license']['text2']="
	Нижче наведена ліцензія Irc-кліенту KVIrc.<br />
	Вона основана на GNU General Public License Версія 2.<br />
	Вона включає в себе всі положення GPL і додає спеціальний виняток (дивіться Терміни та Умови, пункт 13) до обмежень розповсюдження.<br /><br />
	Зауважте що авторським правом на GPL володіє Free Software Foundation, але примірник коду, на який вона посилається, знаходиться під авторським правом Szymon Stefanek та інших членів Команди Розробників KVIrc.<br /><br />
	Початковий код всіх версій KVIrc знаходиться за <a href=\"?id=releases&amp;platform=source&amp;lang=$lang\">цією адресою</a>.<br /><br />
	Розважайтесь!";
/* license.php end */

/* mailinglist.php start */
$template['ml']['title']="Публічний список розсилки KVIrc";
$template['ml']['text1a']="
	Якщо щось пішло зле, якщо маєте питання, пропозицію, чи просто зацікавлені в розробці KVIrc, при'єднуйтесь до публічного списку розсилки KVIrc.";
$template['ml']['text1b']="
	Розробники слідкують за розсилкою і дадуть відповідь як тільки зможуть.";
$template['ml']['text2']="Веб інтерфейс";
$template['ml']['text3']="
	Список має веб інтерфейс <a href=\"http://lists.omnikron.net/mailman/listinfo/kvirc/\">тут</a>.<br />
	Інтерфейс дозволяє підписуватись, скасовувати підписку і керувати акаунтом.";
$template['ml']['text4']="Щоб підписатись на пошту";
$template['ml']['text5']="
	Відправте порожній лист (порожнє тіло і порожній заголовок) на <a href=\"mailto:kvirc-subscribe@lists.omnikron.net\">цю адресу</a> з адреси, з якої ви хочете підписатись.<br />
	Через кілька хвилин ви отримаєте запит підтвердження, що міститиме інструкції для завершення підписки.";
$template['ml']['text6']="Щоб скасувати підписку";
$template['ml']['text7']="
	Відправте порожній лист (порожнє тіло і порожній заголовок) на <a href=\"mailto:kvirc-unsubscribe@lists.omnikron.net\">цю адресу</a> з адреси, з якої треба зняти підписку.<br />
	Через кілька хвилин ви отримаєте запит підтвердження, що міститиме інструкції для завершення скасування підписки.";
$template['ml']['text8']="Архіви списків розсилки";
$template['ml']['text9']="
	Повний архів повідомлень доступний <a href=\"http://lists.omnikron.net/pipermail/kvirc/\">тут</a>.";
/* mailinglist.php end */

/* mirroring.php start */
$template['mirror']['title']="Віддзеркалювання проекту KVIrc";
$template['mirror']['text1']="
	Ця сторінка містить покрокові інструкції щодо створення ftp-дзеркала";
$template['mirror']['text2']="
	Допомога проекту KVIrc віддзеркалюванням його файлів є дуже простим.<br />";
$template['mirror']['text3']="Особливо нам потрібні ftp-дзеркала за межами Європи";
$template['mirror']['title2']="Налаштування дзеркала ftp-master.admin.kvirc.de";
$template['mirror']['tree']="Вимоги";
$template['mirror']['tree1']="ftp-сервер";
$template['mirror']['tree2']="Демон cron (або аналогічний) щоб тримати дзеркало оновленим";
$template['mirror']['text4']="Процедура встановлення";
$template['mirror']['text5']="
	Налаштувати ftp-дзеркало дуже просто: це робиться функцією дзеркалювання в програмі";
$template['mirror']['text6']="
	Команда для отримання повного ftp-архіву kvirc наступна:";
$template['mirror']['text7']="корінь_вашого_ftp_серверу";
$template['mirror']['text8']="
	Тому все що вам треба зробити це дозволити анонімний доступ та сказати cron щоб він синхронізував дзеркало кожні N годин.";
$template['mirror']['text9']="
	Тепер встановіть автоматичні оновлення.<br />
	Це зазвичай робить демон cron і все зводиться до додавання кількох рядків до crontab.<br />
	Приклад такого файлу crontab:";
$template['mirror']['text10a']="
	Цей файл crontab каже cronу виконати команду";
$template['mirror']['text10b']="о 6.30 ночі кожного дня";
$template['mirror']['text11a']="В цому випадку";
$template['mirror']['text11b']="виглядатиме так:";
$template['mirror']['text12']="ваш_домен";
$template['mirror']['text13']="
	Повний ftp-архів на момент запису займає блицько 1.5 GB. Якщо у вас немає місця для повного дзеркала ви можете віддзеркалити лише частину тек ftp.kvirc.net.";
$template['mirror']['text14']="
	Після успішного встановлення дзеркала киньте листа на <b>pragma at kvirc dot net</b> або на <a href=\"?id=mailinglist&amp;lang=$lang\">список розсилки</a> щоб ми додали посилання на основний сайт.";
/* mirroring.php end */

/* news.php start */
$template['news']['title']="Архіви новин";
$template['news']['latest']="Останні новини";
$template['news']['error']="Помилка читання історії";
$template['news']['nonews']="Немає такого запису новин.";
$template['news']['news']="Новини";
$template['news']['readmore']="Читати більше";
/* news.php end */

/* releases.php start */
$template['releases']['title']="Завантаження офіційних релізів";
$template['releases']['text1']="
	Тут ви можете завантажити пакунки <b>офіційних релізів</b> KVIrc.<br />
	Офіційні пакунки випускаються рідше але є найбільш стабільними.<br />
	Будб ласка виберіть потрібний вам тип пакунку";
$template['releases']['text2']="
	Нижче наведений список доступних версій для вибраної вами платформи.<br />Виберіть версію пакунку, який ви хочете завантажити";
$template['releases']['text3']="
	Для вибраної вами платформи та версії існує кілька груп пакунків.<br /><br />Виберіть групу, яку ви хочете завантажити";
$template['releases']['latest']="Останній реліз";
$template['releases']['older']="Старіші релізи";
$template['releases']['available']="Доступні місця для завантаження";
/* releases.php end */

/* screen.php start */
$template['screen']['title']="Скріншоти";
$template['screen']['text']="Маєте гарний скріншот? Відішліть його";
$template['screen']['prev']="назад";
$template['screen']['next']="далі";
$template['screen']['screen1']="Діалог Загальних Налаштувань";
$template['screen']['screen2']="Центр скриптів";
$template['screen']['screen3']="Плагін URL &amp; скрипт об'єктної пощти";
$template['screen']['screen4']="Більше діалогів";
$template['screen']['screen5']="Спливаючі меню каналів";
$template['screen']['screen6']="Діалоги Банів &amp; Режимів каналу";
$template['screen']['screen7']="Оглядач довідки та директорій";
$template['screen']['screen8']="Оглядач директорій";
$template['screen']['screen9']="KVIrc CVS, радісно працюючий під Solaris";
$template['screen']['screen10']="Список вікон, спливаючі вікна відправки DCC та списку користувачів";
$template['screen']['screen11']="Графік I/O, Емулятор терміналу та Аватари";
$template['screen']['screen12']="3 активні з'єднання з сервером";
$template['screen']['screen13']="Аватари, Графік I/O та серверні посилання";
$template['screen']['screen14']="Так! повір своїм очам! KVIrc з відхиленням :)";
$template['screen']['screen15']="Вікно допомоги та віджет доку";
$template['screen']['screen16']="Стандартна тема Fancy з Вікном передачі";
$template['screen']['screen17']="Мінімалістична тема і одне з контекстних спливаючих вікон";
$template['screen']['screen18']="
	Чотири спеціальні вікна. Передача файлів, Перегляд логів, Термінал та Спільні файли: тут для спрощення вашого IRCування.";
$template['screen']['screen19']="Ви скриптер? У KVIrc є кілька інструментів для вас.";
$template['screen']['screen20']="Helix на трьох серверах і багатьох каналах";
$template['screen']['screen21']="Helix під'єднується через psyBNC і гарний значок KVIrc на стільниці :D";
$template['screen']['screen22']="
	Чотири сервери. Зауважте що три вінка зліва показують найактивніші канали.";
$template['screen']['screen23']="Експлойти DCC не працюють з KVIrc :)";
$template['screen']['screen24']="Знімок він bongwater: він працює близько 10 років :)";
$template['screen']['screen25']="
	Знімок від <a href=\"http://kvirc.virg0.org\">etherea`</a>: Час не має сенсу";
$template['screen']['screen26']="Знімок від Xemanth^: 'хакнутий' KVIrc під windows";
$template['screen']['screen27']="
	Знімок від <a href=\"http://kvirc.virg0.org\">etherea`</a>: Приліпки новин Pragma в дії :)";
$template['screen']['screen28']="
	Знімок від <a href=\"http://hellvis69.altervista.org\">HelLViS69</a>: Сканер клонів працює :)";
$template['screen']['screen29']="
	Скрипт від Twins і його <a href=\"?id=addons&amp;lang=$lang&amp;version=3.2.3\">медіаплеєр</a> на 'Anomalies'. Також нове оточення скриптування простору імен в вікні редактора псевдонімів.";
$template['screen']['screen30']="
	Тема SilverIRC, стандартна починаючи з KVIrc 3.2.6 після свіжого встановлення. Скріншот від thexception";
$template['screen']['screen31']="
	Тема SilverIRC. Менеджер тем. Скріншот від thexception";
$template['screen']['screen32']="Тема SilverIRC. Редактор Псевдонімів. Скріншот від thexception";
$template['screen']['screen33']="Тема SilverIRC. Редактор Подій. Скріншот від thexception";
$template['screen']['screen34']="Тема SilverIRC. Редактор Сповіщень. Скріншот від thexception";
/* screen.php end */

/* scripts.php start */
$template['scripts']['title']="Скрипти";
$template['scripts']['text1']="Приклади скриптів включені в дистрибутив та Git";
$template['scripts']['text2a']="Використайте";
$template['scripts']['text2b']="щоб встановити скрипт. Основний скрипт має бути встановлений в";
$template['scripts']['script1']="
	Італійський скрипт з автовходом, caps-контролем, автоголосом... Повністю налаштовуваний через інтерфейс.";
$template['scripts']['script2']="
	SaNVirC є скриптом для KVirc що включає функції такі як ідентифікація ніку, автовхід, захист, атака, керування ботами, система відсутності, інше.<br /> Він був написаний для ботів IRC-Hispano але його легко адаптувати до інших серверів.";
$template['scripts']['script3']="
	Скрипт Savage є скриптом для геймерів з підтримкою XQF, системною інформацією, qauth...";
$template['scripts']['script4']="
	Це перший публічний випуск скрипта з деякими випраленнями списку сповішень. він такод додає функції AutoOp, AutoVoice, виправляє OPless чан, інше.";
/* scripts.php end */

/* snapshots.php start */
$template['snapshots']['title']="Розробницькі знімки";
$template['snapshots']['text1']="
	Розробницькі знімки є неофіційними пакунками зробленими з Git на нерегулярній основі. Кожен знімок відображає стан Git певної дати і ви швидше всього знайдете останній. Пакунки були протестовані хоча б на кількох системах і ймовірно зберуться і у вас. Також наявні деякі бінарні збірки.";
	$template['snapshots']['text2']="
	Знімки початкових кодів готуються Командою Розробників KVIrc.<br />
	Честь і Слава! :)";
$template['snapshots']['text3']="
	Щоб завантажити останній знімок покопайтесь в
	<a href=\"ftp://ftp.kvirc.de/pub/kvirc/snapshots/\">the KVIrc ftp</a> або в підтеці \"snapshots\" на одному з FTP дзеркал.";
/* snapshots.php end */

/* splash.php start */
$template['splash']['title']="Заставки";
$template['splash']['text']="Набір заставок, що раніше використувались в KVIrc.";
$template['splash']['date']="Дата релізу";
$template['splash']['in']="Заставка наявна в";
/* splash.php end */

/* status.php start */
$template['status']['title']="Статус проекту";
$template['status']['text']="
	<p>Після більше ніж 10 років розробки KVIrc став самодостатнім та повнофункціональним клієнтом IRC, чудовим другом для проведення ваших щоденних сеансів IRC.</p>
	<p>Останнім стабільним випуском є <a href=\"http://kvirc.net/?id=news&story=2012.07.03.03.15.1.story&dir=latest&lang\">4.2.0 \"Equilibrium\"</a>.
	Він опублікований 03 липень, 2012.
	Початковий код можна взяти з сторінки <a href=\"?id=download&amp;lang=$lang\">завантаження</a>.</p>
	<p>Якщо ви шукаєте офіційні випуски, гляньте в <a href=\"?id=releases&amp;lang=$lang\">цій секції</a>, вони випускаються рідше але є найстабільнішими. Виберіть випуск для Linux, Windows, OS X чи пакунок з початковим кодом.</p>
	<p>Знімки розміщені <a href=\"?id=snapshots&amp;lang=$lang\">тут</a> а Git <a href=\"?id=git&amp;lang=$lang\">тут</a>.</p>
	<p>Також зверніть увагу на <a href=\"?id=install&amp;lang=$lang\">нотатки щодо встановлення</a>, <a href=\"?id=tutorials&amp;lang=$lang\">посібники</a>, <a href=\"?id=translation&amp;lang=$lang\">переклади</a> та <a href=\"?id=themes&amp;lang=$lang\">теми</a> щоб налаштувати KVIrc під себе =)</p>";
/* status.php end */

/* git.php start */
$template['git']['title']="Cloning the Git Source Tree";
$template['git']['text1']="
	The Git source tree is hosted on Github.<br />
	Once you've made sure that <a href=\"https://git-scm.com/\" target=\"_blank\">git</a> is installed on your system you should clone the tree
	with the following command:<br />";
$template['git']['text3']="
	To compile the executable and the core modules just enter the source directory:";
$template['git']['text4']="
	and then follow the common <a href=\"?id=install&amp;lang=$lang\">installation instructions</a>.<br />
	The latest installation instructions for the Git version of KVIrc can be also found in the INSTALL file.<br />
	We're trying to keep the Git as \"clean\" as possible but it *might* happen that the sources you have downloaded do not compile or run properly.<br />
	You can also browse trough the Git via <a href=\"https://github.com/kvirc/KVIrc\">https://github.com/kvirc/KVIrc</a>";
/* git.php end */

/* themes.php start */
$template['themes']['title']="Теми";
$template['themes']['text1']="Тут можна завантажити гарні теми";
$template['themes']['text2a']="Як мені встановити тему";
$template['themes']['text2b1']="Завантаження тему";
$template['themes']['text2b2']="Відкрийте Менеджер тем KVIrc";
$template['themes']['text2b3']="Натисніть кнопку \"Встановити тему з диску\" ";
$template['themes']['text2b4']="Двічі клакніть на тему";
$template['themes']['text2b5']="Насолоджуйтесь";
$template['themes']['text3a']="Як мені створити тему";
$template['themes']['text3b1']="Існує невелике керівництво, його можна знайти";
$template['themes']['text3b2']="тут";
$template['themes']['text3b3']="і Італійська версія";
$template['themes']['text3b4']="Англійська версія керівництва включена в встановлювальний пакунок KVIrc";
$template['themes']['text4a']="Я зробив тему. Як мені поділитись нею";
$template['themes']['text4b']="Відішліть її до";
$template['themes']['text4c']="з назвою теми, описом, версією, вашим ніком, веб-сторінкою та е-поштою, а також дайте чи ні дозвіл на відображення ваших даних на сторінці";
$template['themes']['text5']="";
$template['themes']['screenshot']="скріншоти";
$template['themes']['theme0']="The icons and colors used in the early 4.x releases.";
$template['themes']['theme1']="Гарнюня, основана на наборі значків Marble.";
$template['themes']['theme2']="Чиста тема з значками Crystal. Деякі значки взяті з набору Marble.";
$template['themes']['theme3']="Тема з зеленим фоном.";
$template['themes']['theme4']="Темна тема.";
$template['themes']['theme5']="Біла водяна округла.";
$template['themes']['theme6']="Рожевий приклад...";
$template['themes']['theme7']="Прозора тема, призначена для використання з тлом KDE. Для гарної видимості і контрасту.";
$template['themes']['theme8']="Досить розслабляюча тема, натхненна сайтом http://www.PayneReactor.com";
$template['themes']['theme9']="Гарна чорна тема, основана на іншій криштальній темі :)";
$template['themes']['theme10']="Ще одна темна тема з логотипом Slackware і чорною багірою";
$template['themes']['theme11']="Темна тема, основана на XCrystall-black";
$template['themes']['theme12']="Чиста любов. Чиста білизна. Чиста, акуратна тема";
$template['themes']['theme13']="Скляна темна тема";
$template['themes']['theme14']="Ще одна темна тема";
$template['themes']['theme15']="Тема X-mas для KVIrc";
$template['themes']['theme16']="Збоченість це просто стиль життя; темна тема з малою гамою";
$template['themes']['theme17']="еротика.. мм..";
$template['themes']['theme18']="Гнів це різновид еротики. Продовжуйте лизати ваші губи!";
$template['themes']['theme19']="Темно Синій це різновид мармуру. Насолоджуйтесь";
$template['themes']['theme20']="Після багатьох \"темних\" фонів, м'яко синій для зручного читання";
$template['themes']['theme21']="Спокійна, сніжна Різдвяна тема";
$template['themes']['theme22']="Сніговий ліс для відпочинку в IRC";
$template['themes']['theme23']="Зелена тема з логотипом KDE";
$template['themes']['theme24']="Дуже мінімалістична тема";
$template['themes']['theme25']="Тема зі злегка жовтим фоном на основі Pure від etherea`";
$template['themes']['theme26']="Літня сонячна тема";
$template['themes']['theme27']="Темна тема, портована зі скрипта mirc";
$template['themes']['theme28']="Тема, що перетворить ваш KVIrc в mIRC";
$template['themes']['theme29']="Надзвичайно мінімалістична тема";
$template['themes']['theme30']="Тема, яка просвітить ваш розум";
$template['themes']['theme31']="Тема, натхнення новелами R.A. Salvatore про Дроу (Темні Ельфи) і особливо Drizzt Do'Urden";
$template['themes']['theme32']="...бо весь світ це красивий фрактал!";
$template['themes']['theme33']="Темна техно-тема з простими та описовими значками";
$template['themes']['theme34']="Тема, зроблена порталом CoreZeam.org";
$template['themes']['theme35']="Тема, основану на чорному, легко побачити та розрізнити";
$template['themes']['theme36']="Рожева тема, натхненна Hello Kitty";
$template['themes']['theme37']="Зручний для очей фон з оновлюваним водоспадом... поєднаний з світлою бірюзовою прозорістю. Чітко поєднуваний колір тексту з джерелом повідомлення";
$template['themes']['theme38']="Celebration це досить рожева тема, вона ясна; ясні теми не мої улюблені але ця подібна на святкування: твоє життя, твій світ, твоя любов";
$template['themes']['theme39']="Гарна світла тема з делікатним зеленим фоном великого розширення та значками стану каналу старого стилю";
$template['themes']['theme40']="Темна тема, оптимізована для роботи з монітором з мінімальною яскравістю і для безпечної комунікації.";
$template['themes']['theme41']="Світла тема від автора VDark.";
$template['themes']['theme42']="Проста темна тема";
$template['themes']['theme43']="Проста темна тема";
/* themes.php end */

/* tools.php start */
$template['tools']['title']="Інструменти";
$template['tools']['text1']="Тут можна знайти інструменти, що мають відношення до KVIrc";
$template['tools']['tool1']="Підсвічування KVS-синтаксису для Notepad++";
$template['tools']['tool2']="Простий tcl для eggdrop, щоб заставити їх відповідати на певні запити CTCP";
$template['tools']['tool3']="Синдикація RSS з tcl для eggdrop, щоб заставити їх відповідати на певні перемикачі, що опитують Git та RSS";
$template['tools']['tool4']="Простий скрипт, написаний на TCL для перевірки файлів перекладу GetText і повідомлення про можливі помилки";
$template['tools']['tool5']="Простий скрипт на PHP-CLI, що конвертує форматовані KVIrc журнали в простий текст і усуває колір та контрольні символи";
$template['tools']['tool6']="A simple plugin for Supybot to make it reply to some CTCP requests";
/* tools.php end */

/* translation.php start */
$template['translation']['title']="Переклади";
$template['translation']['step']="Крок";
$template['translation']['text1']="
	На цій чторінці ви знайдете деяку інформацію про стан перекладу KVIrc. Щоб дізнатись чи ваша мова підтримується, погляньте на список нижче.";
$template['translation']['text2']="
	Багато людей працюють над перекладом на різні мови. Щоб при'єднатись до команди вам лише треба знати рідну мову: <b>знати програмування не потрібно</b>.";
$template['translation']['text3']="
	Всі переклади <b>ПОВИННІ БУТИ В UTF-8</b>. Файли перекладу з іншим кодуванням символів будуть відхилені.";
$template['translation']['text4']="
	Якщо ви хочете перекласти KVIrc на нову мову, ви можете знайти тут гарну інструкцію.<br />
	Деякі мови оновляються  (майже) щодня, інші потребують нового координатора. Якщо ви хочете покращити підтримку вашої мови, будь ласка зв'яжіться з <b>Останнім перекладачем</b>, що наведений нижче:";
$template['translation']['text5']="не супроводжується";
$template['translation']['text6a']="
	Фраза \"не супроводжується\" означає, що нам потрібна ваша допомога з перекладом.<br />
	Щоб це зробити, підпишіться на";
$template['translation']['text6b']="
	щоб тримати зв'язок з розробниками і сказати про ваш інтерес в перекладі KVIrc.";
$template['translation']['text7']="
	Це невеличке керівництво описує процедуру перекладу KVIrc на нову мову";
$template['translation']['text8']="Завантажте правильний початковий код.";
$template['translation']['text9a']="
	Спершу вам потрібна Git-версія KVIrc. Щоб отримати Git-версію коду, читайте інструкції на";
$template['translation']['text9b']="Дані по перекладу знаходяться в";
$template['translation']['text10']="Налаштуйте оточення для збирання";
$template['translation']['text11']="
	Зайдіть в теку з вихідним кодом KVIrc і прочитайте документацію в doc/INSTALL на предмет запуску CMake для генерування потрібних фалів Makefile.";
$template['translation']['text12']="Визначення вашого мовного коду";
$template['translation']['text13']="
	Вам потрібно занти код вашої мови. Зазвичай це рядок, складений з якнайменше двох букв і він може бути отриманий зі змінної оточення \$LANG або можна глянути на";
$template['translation']['text14']="Приклади таких кодів";
$template['translation']['text15']="Генерування списку повідомлень для перекладу";
$template['translation']['text16']="
	Вам потрібен цей крок, якщо на вашу мову KVIrc перекладається вперше. Якщо ви хочете оновити існуючий переклад то переходьте до кроку 4.<br />
	Зайдіть в теку збирання і запустіть наступну команду щоб виятгнути повідомлення з початкових
кодів:";
$template['translation']['text17']="
	В підтеках тека_збирання/po/ буде створений набір файлів .pot<br />
	Кожен файл відповідає за специфічний компонент KVIrc: так, основний файл перекладу знаходиться в тека_збирання/po/core/kvirc/kvirc.pot<br />
	Створіть копії цих файлів з назвами файл_xxx.po де файл це назва компоненту та xxx код вашої мови, визначений в кроці 2.";
$template['translation']['text18']="
	...і так для всіх модулів; ви не повинні перекладати всі файли за раз, але бажано створити кістяк для всіх компонентів.";
$template['translation']['text19']="Переклад повідомлень";
$template['translation']['text20']="
	Якщо ви виконали крок 3, тоді ви тільки но створили файли *_xxx.po (напр. kvirc_it.po), де xxx - це код вашої мови (з кроку 2).<br />
	Якщо ви перейшли сюди з кроку 2, тоді вам треба знайти існуючі файли *_xxx.po в підтеках папки kvirc/po.<br />
	Якщо в вашій мові немає таких файлів, ви напевне не створили їх на кроці 3.";
$template['translation']['text21']="
	Ви можете перекладати файли типу *.po простим текстовим редактором (які <b>ПОВИННІ</b> підтримувати UTF-8), але набагато зручніше користуватись програмами перекладу, такими як lokalize для linux/kde чи poedit для windows.";
$template['translation']['text22']="
	Уточнення щодо формату файлів.<br />
	Файли *.po містять набір рядків як наступний:";
$template['translation']['text23a']="/шлях/до/файлу/що/містить/рядок: номер рядка";
$template['translation']['text23b']="Оригінальне англійське повідомлення";
$template['translation']['text23c']="Переклад";
$template['translation']['text24']="
	<i>msgid</i> - це оригінальне повідомлення, яке треба перекласти а <i>msgstr</i> це переклад (який зразу після створення kvirc_xxx.po буде порожнім).";
$template['translation']['text25']="
	msgid може містити теги html, звороти як \"\\n\" і рядки формату як \"%s\". Ви <b>ПОВИННІ</b> зберегти теги, звороти та формати в перекладі як в оригіналі. Зверніть увагу на специфікації формату (%s, %W, %Q, ...).<br />
	Вони повинні бути в <b>ТОЧНІСІНЬКО</b> такому ж порядку як у msgid: зміна порядку чи написання невірного формату раніше чи пізніше призведе до крахів.";
$template['translation']['text26']="Додавання перекладу до системи встановлення";
$template['translation']['text27']="
	Після того як ви переклалипевні рядки ви можете спробувати додати переклад в KVIrc. Якщо ви оновлюєте існуючий переклад то ви можете перейти до кроку 6.";
$template['translation']['text28']="
	Ви повинні заставити систему збирання взяти створені вами файли перекладу і скомпілювати їх. Це робиться одним кроком. Вам треба всього лише очистити CMakeCache.txt (що розміщений в папці збирання) і перезапустити CMake щоб він підібрав нові файли перекладу, потім зберіть KVIrc як зазвичай.<br />
	Коли збирання закінчилось, переходьте до наступного кроку.";
$template['translation']['text29']="Спроба перекладу в дії";
$template['translation']['text30']="Запустіть make і зачекайте його завершення.";
$template['translation']['text31']="
	Перевірте змінну оточення \$LANG.<br />
	Якщо ви перекладаєте на мову, аналогічну до мови вашої системи/користувача, швидше за все немає необхідності змінювати мову.<br />
	В іншому випадку вам потрібно вам потрібно вказати змінну \$LANG для оточення при старті KVIrc.";
$template['translation']['text32']="
	KVIrc повинен взяти файли перекладу і використовувати їх.";
$template['translation']['text33']="Оновлення перекладу після зміни початкового коду";
$template['translation']['text34']="
	В процесі розробки KVIrc в початковий код додаються нові рядки повідомлень, інші можуть бути змімені або взагалі видалені.<br />
	Після того, як ви зробите svn update щоб отримати свіжий код, зайдіть в теку збирання і запустіть:";
$template['translation']['text35']="
	Ця процедура оновить повідомлення в ваших файлах *_xxx.po і позначить старі повідомлення прапорцем fuzzy(розмитий) або недійсні.<br />
	Недійсні повідомлення треба перекладати наново, тоді як розмиті містять незначні зміни і можуть бути виправлені за кілька секунд.";
$template['translation']['text36']="Інші нотатки";
$template['translation']['text37']="
	Якщо ви не впевнені в якомусь перекладі, ви можете глянути як подібні вирази перекладені в файлах KDE *.po, чи в інших програмах. Якщо вам потрібна подальша допомога, зв'яжіться з нами на нашому списку розилски чи в irc (irc://irc.freenode.net/#KVIrc).";
$template['translation']['text38']="
	Оскільки багато модулів мають власні файли перекладів, то процедура описана вище може бути повторена для підтек po/modules/*/.<br />
	Ви не повинні перекладати всі файли за один раз: частковий переклад також спрацює.";
$template['translation']['text39']="
	Коли ви задоволені своїм перекладом ви можете відіслати ваші файли *.po на список розсилки KVIrc і попросити про включення файлів до Git. Якщо ви хочете координувати перекладом і надалі тоді ви також можете попросити аккаунт в Git.";
$template['translation']['text40']="Веселого перекладу :)";
/* translation.php end */

/* tutorials.php start */
$template['tutorials']['title']="Підручники";
$template['tutorials']['archive']="Повний архів";
$template['tutorials']['tutorial']="Підручник";
$template['tutorials']['madeby']="створений";
$template['tutorials']['text1a']="Мистецтво Скриптів";
$template['tutorials']['text1b']="Дуже докладний підручник по скриптах";
$template['tutorials']['tree1c']="Ввведення в мову";
$template['tutorials']['tree1d']="Цикли, умови та псевдоніми";
$template['tutorials']['tree1e']="Масиви, словники, об'єкти та класи";
$template['tutorials']['tree1f']="Події та сповіщення";
$template['tutorials']['tree1g']="Графічні об'єкти та схеми";
$template['tutorials']['tree1h']="Клас-обгортка";
$template['tutorials']['tree1i']="Слоти та сигнали";
$template['tutorials']['tree1j']="Сирі події та дії";
$template['tutorials']['tree1k']="Сокети та Perl";
$template['tutorials']['text2a']="Збирання KVIrc для Win32";
$template['tutorials']['text2b']="Посібник зі збирання KVIrc під Win32";
$template['tutorials']['text3a']="Підручник скриптування KVIrc для початківців";
$template['tutorials']['text3b']="Повне керівництво для початківця";
$template['tutorials']['text4a']="Встановлення KVIrc під Win32";
$template['tutorials']['text4b']="Короткий посібник щодо встановлення KVIrc, під'єднання до серверу та при'єднання до каналу під windows";
$template['tutorials']['dropmail']="Якщо ви написали ЧаПи, посібник чи керівництво для KVIrc на будь якій мові, киньте лист на";
$template['tutorials']['text5a']="Створення тем";
$template['tutorials']['text5b']="Маленький посібник як зробити гарну тему";
$template['tutorials']['text6a']="Модифікація встановлювача під Win32";
$template['tutorials']['text6b']="Інструкція: як перепакувати інсталятор для включення в нього змінений стандартний скрипт, тему чи ще щось";
$template['tutorials']['text7a']="Зареєстровані користувачі";
$template['tutorials']['text7b']="Керівництво щодо керування базою зареєстрованих користувачів";
/* tutorials.php end */

/* welcome.php start */
$template['welcome']['title']="Вітаємо!";
$template['welcome']['text']="
	KVIrc є <a href=\"http://www.gnu.org\">вільним</a> портативним <acronym title=\"Internet Relay Chat\">IRC</acronym> клієнтом основаним на чудовому <a href=\"http://www.trolltech.com\">інструментарії Qt GUI</a>.
	KVirc пишеться <a href=\"http://www.pragmaware.net\">Симоном Стефанеком</a> і командою розробників KVIrc з вкладом багатьох зацікавлених в IRC розробників зі всього світу.";
$template['welcome']['text2']="стань частиною проекту!";
$template['welcome']['alttext']="як допомогти проекту KVIrc";
/* welcome.php end */
?>
